#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/AbelardLindsay/learning-devops-stuff/runs/run-eUpwNLW7sPwi5gLJ

Waiting for the plan to start...

Terraform v1.2.7
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources]
azurerm_virtual_network.main: Refreshing state... [id=/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources/providers/Microsoft.Network/virtualNetworks/test-network]
azurerm_public_ip.pip: Refreshing state... [id=/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources/providers/Microsoft.Network/publicIPAddresses/test-pip]
azurerm_subnet.internal: Refreshing state... [id=/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources/providers/Microsoft.Network/virtualNetworks/test-network/subnets/internal]
azurerm_network_interface.internal: Refreshing state... [id=/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources/providers/Microsoft.Network/networkInterfaces/test-nic2]
azurerm_network_interface.main: Refreshing state... [id=/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources/providers/Microsoft.Network/networkInterfaces/test-nic1]
azurerm_network_security_group.casual-server: Refreshing state... [id=/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources/providers/Microsoft.Network/networkSecurityGroups/casual-server]
azurerm_linux_virtual_machine.main: Refreshing state... [id=/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources/providers/Microsoft.Compute/virtualMachines/test-vm]
azurerm_network_interface_security_group_association.main: Refreshing state... [id=/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources/providers/Microsoft.Network/networkInterfaces/test-nic2|/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources/providers/Microsoft.Network/networkSecurityGroups/casual-server]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.main must be replaced
-/+ resource "azurerm_linux_virtual_machine" "main" {
      ~ computer_name                   = "test-vm" -> (known after apply)
      - encryption_at_host_enabled      = false -> null
      ~ id                              = "/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources/providers/Microsoft.Compute/virtualMachines/test-vm" -> (known after apply)
        name                            = "test-vm"
      ~ private_ip_address              = "10.0.2.4" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.0.2.4",
          - "10.0.2.5",
        ] -> (known after apply)
      ~ public_ip_address               = "137.117.148.93" -> (known after apply)
      ~ public_ip_addresses             = [
          - "137.117.148.93",
        ] -> (known after apply)
      - secure_boot_enabled             = false -> null
      - tags                            = {} -> null
      ~ virtual_machine_id              = "9ed37b20-010a-4d35-a099-2adddec6599f" -> (known after apply)
      - vtpm_enabled                    = false -> null
        # (14 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
          ~ name                      = "test-vm_OsDisk_1_f5f05bc54c2c4bc2b174a503e36390ef" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ source_image_reference {
          ~ sku       = "16.04-LTS" -> "22.04-LTS" # forces replacement
            # (3 unchanged attributes hidden)
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.


```

</details>

*Pushed by: @AbelardLindsay, Action: `pull_request`*